{"comment_count":0,"content":"The Snap! Jamaal Jackson tore knee ligaments in their win over the Denver Broncos. Making his first NFL start at center will be Nick Cole. Cole filled in at center against the Broncos, but McNabb fumbled two snaps, and three offensive linemen were penalized for false starts. While you can&#39;t blame all the false starts on the new center, it certainly doesn&#39;t make things easier for the linemen.   The good news is that Brian Westbrook is back after missing 5 games. His performance last week against the Broncos was promising, he had 9 carries for a total of 32 yards. In his last game against Dallas, Westbrook carried the ball 13 times for 50 yards rushing.   Does it matter that Michael Vick may not be available to play? Probably not, but we&#39;d certainly like to see him out on the field for a few key plays. If McNabb gets hurt, Kevin Kolb who proved himself against the Chiefs can help the Eagles soar to victory.   Bring out your big guns Dallas, we&#39;re flying into town with victory on our minds!  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"Biggest Challenge for the Eagles This Week?","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2009-12-31 16:27:39","author_id":762,"post_id":969,"lang":"en","url":"jasontromm.wordpress.com\/2009\/12\/31\/biggest-challenge-for-the-eagles-this-week"}
{"comment_count":0,"content":"\r\n\r\n\r\n\r\nPenguins!\r\n\r\n\r\n\r\n","author":"jasontromm","title":"My Newest Cube Toy","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-01-06 14:48:55","author_id":762,"post_id":970,"lang":"en","url":"jasontromm.wordpress.com\/2010\/01\/06\/my-newest-cube-toy"}
{"comment_count":0,"content":"\r\n\r\n\r\nDonovan McNabb's performance Saturday night against Dallas was ... what's the right word ... pathetic! One completed pass in the entire first half? Really, that's all you could manage Donovan? That was the biggest letdown I've ever experienced in over 30 years of watching the Eagles.\r\n\r\nEarlier I wrote about Philadelphia's acquisition of Michael Vick as their backup quarterback. It's time for Vick to become their starting quarterback. That game against Dallas should be McNabb's last game as the Eagles starter. The only excitement for Eagles fans came in the first half when Vick threw a pass for 67 yards and a touchdown. That quieted the 90,000+ Cowboys fans in Arlington.\r\n\r\nWhy Andy Reid didn't leave Vick in the game after that, I'll never understand. The team was fired up and the Cowboys defense was back on their heels after that first touchdown. Why bring McNabb back into the game? It's going to be a very long off-season for Andy Reid, I really hope he thinks about his choice for starting QB next year.\r\nPosted via email from Jason's posterous\r\n\r\n\r\n","author":"jasontromm","title":"Time to put McNabb on the Bench","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-01-11 16:48:34","author_id":762,"post_id":971,"lang":"en","url":"jasontromm.wordpress.com\/2010\/01\/11\/time-to-put-mcnabb-on-the-bench"}
{"comment_count":0,"content":"\r\nIf you think the Republicans are against big government, think again.  When George W. Bush was in the Whitehouse, they passed the largest expansion of government healthcare ever. (It will be eclipsed by Obamacare if that ever passes.)\r\n\r\nSome of the Republicans who voted against Obamacare in the Senate are hypocrites. They were OK with a huge expansion of Medicare in 2003 when their guy was in the Whitehouse, but they are against a similar expansion of government when the other party is in the Whitehouse.\r\n\r\nThe following Republicans Voted for the final bill Alexander, Allard, Allen, Bennett, Bond, Brownback, Bunning, Burns, Campbell, Chambliss, Cochran, Coleman, Collins, Cornyn, Crapo, DeWine, Dole, Domenici, Enzi, Fitzgerald, Frist, Grassley, Hatch, Hutchison, Inhofe, Kyl, Lugar, McConnell, Murkowski, Roberts, Santorum, Sessions, Shelby, Smith, Snowe, Specter, Stevens, Talent, Thomas, Voinovich and Warner.\r\n\r\nColeman was denied another term by the trickery of Al Franken’s campaign or he would probably still be in the Senate. Specter was a RINO who finally admitted it and switched to the Democrat party. There’s a good chance the good people of Pennsylvania will be pissed off enough to get rid of Specter, finally. Collins and Snowe always have been and are still RINO’s in the Senate and they should be voted out.\r\n\r\nAlexander, Bennett, Bond, Brownback, Bunning, Chambliss, Cochran, Cornyn, Crapo, Enzi, Grassley, Hatch, Hutchison, Inhofe, Kyl, Lugar, McConnell, Murkowski, Roberts, Sessions, Shelby and Voinovich are all hypocrites who have somehow managed to keep their seats.  They all need to be voted out at the next opportunity.\r\n\r\nThe rest lost their seats in the intervening years. Some lost them in the anti-incumbent fervor that swept through the country and gave the Democrats control of the Senate and the Whitehouse.\r\n\r\n\r\n","author":"jasontromm","title":"Republican Hypocrites in the Senate","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-01-20 17:07:21","author_id":762,"post_id":977,"lang":"en","url":"jasontromm.wordpress.com\/2010\/01\/20\/republican-hypocrits-in-the-senate"}
{"comment_count":0,"content":"\r\nIf I was a Democrat, I wouldn't want Barack Hussein Obama flying in to campaign for me at the last minute. Every time he does, Obama fails.\r\nSeptember 2009: Obama campaigns to bring the Olympics to Chicago. Fail!\r\nOctober 2009: Obama campaigns for a climage change treaty in Copenhagen. Fizzle!\r\nNovember 2009: Obama campaigns for Corzine in New Jersey. Republicans win the governor's mansion in New Jersey and Virginia. Double Fail!\r\nJanuary 2010: Obama campaigns for Martha Coakley. Hell freezes over! The seat held by Teddy Kennedy for over 40 years is taken over by a Republican.\r\nNovember 2010: Democrats run away from Obama in droves!\r\n\r\n","author":"jasontromm","title":"Obama's Campaign Failures","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-01-20 19:42:44","author_id":762,"post_id":978,"lang":"en","url":"jasontromm.wordpress.com\/2010\/01\/20\/obamas-campaign-failures"}
{"comment_count":0,"content":"Obama&#39;s State of the Union speech may have been unprecedented! He dissed the Supreme Court and the American people. How dumb does he think we are? I wish Justice Alito had the same amount of courage as Joe Wilson. Alito should have said out loud the words he only mouthed, \"That&#39;s not true.\" Here&#39;s what Barack had to say to SCOTUS.  With all due deference to separation of powers, last week the Supreme Court reversed a century of law that I believe will open the floodgates for special interests - including foreign corporations - to spend without limit in our elections. I don&#39;t think American elections should be bankrolled by America&#39;s most powerful interests, or worse, by foreign entities. They should be decided by the American people. And I&#39;d urge Democrats and Republicans to pass a bill that helps to correct some of these problems.  I can&#39;t recall another President dissing the Supremes in that way during a SOTU address. As soon as he says, \"with all due deference\" you know he&#39;s about to disrespect somebody.   Here&#39;s what he had to say to the American people about healthcare reform:  It is precisely to relieve the burden on middle-class families that we still need health insurance reform. Yes, we do. Now, let&#39;s clear a few things up. I didn&#39;t choose to tackle this issue to get some legislative victory under my belt. And by now it should be fairly obvious that I didn&#39;t take on health care because it was good politics. I took on health care because of the stories I&#39;ve heard from Americans with pre-existing conditions whose lives depend on getting coverage, patients who&#39;ve been denied coverage, families - even those with insurance - who are just one illness away from financial ruin.  Here&#39;s what I heard, \"You, the American sheople were too stupid to understand why we need healthcare reform, so let me explain it to you again.\" I have never heard a President who was so focused on himself. Barack Hussein Obama&#39;s arrogance is truly staggering!  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"Obama's Arrogance is Staggering","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-01-28 13:38:14","author_id":762,"post_id":991,"lang":"en","url":"jasontromm.wordpress.com\/2010\/01\/28\/obamas-arrogance-is-staggering"}
{"comment_count":0,"content":"In an extremely well written and well thought out editorial, Jim DeMint lays out an alternate plan for solving our Nation&#39;s biggest problems. Here are the major points with my comments in italics:  Stop all scheduled tax increases and push Congress to cut taxes across the board so no American pays more than 25 percent of their income in federal taxes. Sounds reasonable to me. Cut federal spending down to 20 percent of GDP, its post-WWII average as a share of the economy, and impose a moratorium on all earmarks until the budget is balanced.This is a great idea, but I doubt it will fly. Keep the detention facility at Guantanamo Bay open to ensure that terrorists cannot be released or transferred into the United States.Obama&#39;s base would be angered if he went back on his campaign promise to close Gitmo. Protect our nation&#39;s intelligence community from civil liability stemming from the actions that prevent acts of terrorism.I&#39;m not sure I agree completely with this point. Reform entitlements to give Americans greater control over their retirement, keep our promises to seniors, and control long-term spending without raising taxes. I&#39;m all for privatizing Social Security and creating the \"lockbox\" that congress critters are always talking about. Lower health care costs without growing the government by limiting frivolous medical lawsuits and by allowing Americans to access health plans across state lines. Two excellent ideas that the Republicans need to insist on before any healthcare bill is passed. Now that they have 41 Senate votes, they might be able to get the Democrats to listen. Lower energy prices and reduce our dependence on Middle East oil by allowing exploration in Alaska and the Outer Continental Shelf.\"Drill Here, Drill Now!\" Enhance primary and secondary education by reforming the No Child Left Behind law so states have the flexibility to innovate and achieve results in the classroom. This doesn&#39;t go far enough. We need to completely repeal NCLB. In face, I think we should completely abolish the Department of Education and return control of schools to local governments and parents.  So, I agree with Senator DeMint on almost everything he said, except his plan to reform education.  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"Jim DeMint should have given the Republican response to SOTU address","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-01-28 13:49:12","author_id":762,"post_id":992,"lang":"en","url":"jasontromm.wordpress.com\/2010\/01\/28\/jim-demint-should-have-given-the-republican-response-to-sotu-address"}
{"comment_count":0,"content":"My whole family cracked up at Tim Tebow and his Mother in the Focus on the Family commercial. I have no idea what the NAG&#39;S are so upset about. They didn&#39;t mention abortion at all!  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"I'm much tougher than you are! #SB44","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-07 23:57:32","author_id":762,"post_id":993,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/07\/im-much-tougher-than-you-are-sb44"}
{"comment_count":1,"content":"They did pretty good, for an old bunch of rockers. Much better than the Rolling Stones who looked stoned when they performed. Roger Daltry&#39;s vocals were a little rough, but Pete Townshend hasn&#39;t lost anything on guitar. I thought their song choice was great, \"Pinball Wizard,\" \"Baba O&#39;Reilly,\" \"Who Are You?\" and \"Won&#39;t Get Fooled Again\" were musts. The only odd song in the set was \"Can You Hear Me?\" I was satisfied with the mini-concert I saw.  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"The Who's Superconcert #SB44","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-08 01:36:53","author_id":762,"post_id":994,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/07\/the-whos-superconcert-sb44"}
{"comment_count":0,"content":"Darling and Monty","author":"jasontromm","title":"","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-08 03:56:43","author_id":762,"post_id":995,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/07\/995"}
{"comment_count":0,"content":"Our HouseSnow on the TreesSnowboardSnow on the Trees3.5 InchesTJ was having lots of fun throwing snowballs and eating snow!TJ was having lots of fun throwing snowballs and eating snow!Snowed In?Darling Kitty","author":"jasontromm","title":"","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-13 16:06:27","author_id":762,"post_id":996,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/13\/996"}
{"comment_count":0,"content":"Bug-Eyed Snowman","author":"jasontromm","title":"","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-13 17:26:20","author_id":762,"post_id":997,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/13\/997"}
{"comment_count":0,"content":"I&#39;ve seen several posts on Facebook and heard some people saying, \"What&#39;s with that sport where they ski, then shoot and ski again? What&#39;s up with that?\" I originally thought the sport originated with German army units in World War II that traveled on skis carrying all their gear with them. They had to be ready to shoot at a moment&#39;s notice.   It turns out, the origins of the sport go back even further than that to Neolithic hunters who shot arrows and wore \"sliding timber\" on their feet. Written descriptions of military units on skis go back as far as the Romans in 400 BC. You can read more about how the sport evolved here and here.  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"Origins of Biathlon","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-16 18:45:50","author_id":762,"post_id":998,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/16\/origins-of-biathlon"}
{"comment_count":1,"content":"Let Freedom Ring has a great summary of what the Tea Party movement is not:   The Tea Party movement is not a nascent third party. The Tea Party movement is not \"anti-tax.\"   The Tea Party movement is not driven by social conservatism.  The Tea Party movement is not some subculture of bug-eyed lunatics! The Tea Party movement is a made up of individuals and organizations who believe in a government limited by the powers enumerated in the Constitution and the Tenth Amendment. People in this grass-roots freedom movement are for lower taxes, smaller government and less intrustion in their lives generally.   How do you accomplish these things? Abolish unconstitutional government programs to make the government smaller. The federal Departments of Education, Housing and Urban Development would be a good place to start. Getting the government out of the healthcare and retirement planning business would be good too.   Some people say the Tea Party movement is led by Fox News and big corporations, especially insurance and pharmacutical companies. When I attended a rally last year, I didn’t see one sign made by big pharma and Fox News was nowhere to be seen.   The United States government needs to learn to live within its means. The current high tax rates do not encourage people to do their best. Why work harder if it puts you into a higher tax bracket? The Reagan tax cuts proves that cutting tax rates actually increases revenue.   I’ve always advocated for a Fair Tax or a flat tax. No more than 9% for everybody. (Government shouldn’t ask for more than God.) If that doesn’t meet current budgets, then you need major cuts in government.   If you want to learn what the Tea Party movement is all about, don&#39;t read the New York Times. Attend a rally and see for yourself.  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"What is the Tea Party movement all about?","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-17 14:37:33","author_id":762,"post_id":999,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/17\/what-is-the-tea-party-movement-all-about"}
{"comment_count":0,"content":" \"Our people look for a cause to believe in. Is it a third party we need, or is it a new and revitalized second party, raising a banner of no pastels, but bold colors, which make it unmistakably clear where we stand on all of the issues troubling the people?\" ~Ronald Reagan on March 1, 1975  Posted via email   from Jason's posterous  ","author":"jasontromm","title":"Sound Familiar?","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-02-22 15:14:55","author_id":762,"post_id":1000,"lang":"en","url":"jasontromm.wordpress.com\/2010\/02\/22\/sound-familiar"}
{"comment_count":0,"content":"and all the pollen that comes with it.\n\nThis message has been sent using the picture and Video service from Verizon Wireless!\n\nTo learn how you can snap pictures and capture videos with your wireless phone visit www.verizonwireless.com\/picture.\n\nNote: To play video messages sent to email, Quicktime@ 6.5 or higher is required.\n","author":"jasontromm","title":"Spring is here","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-09 18:04:22","author_id":762,"post_id":1001,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/09\/spring-is-here"}
{"comment_count":0,"content":" <rant>We lose an hour of sleep in the spring, for what? It&#39;s dark in the morning when I need the sun to wake me. It&#39;s light at night when I need my son to go to sleep! It completely disrupts my days for at least two weeks. <\/rant> The government claims daylight saving time saves energy, but scientific studies in 1976 proved otherwise. We have enough daylight, we don&#39;t need to save anymore!    Posted via email   from Jason's posterous  ","author":"jasontromm","title":"I Hate DST!","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-15 14:24:28","author_id":762,"post_id":1002,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/15\/i-hate-dst"}
{"comment_count":0,"content":" ...but I don&#39;t feel fine. Still in shock over how stupid Bart Stupak is. Listen, moron, you can&#39;t trust anything Obama says. He&#39;s proven himself to be the most pro-abortion President in history and you trust him to write a Pro-Life executive order? It&#39;s not worth the paper it&#39;s written on!   Posted via email   from Jason's posterous  ","author":"jasontromm","title":"It's the End of the World as We Know It...","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-22 15:01:58","author_id":762,"post_id":1003,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/22\/its-the-end-of-the-world-as-we-know-it"}
{"comment_count":0,"content":"At the close of the Constitutional Convention of 1787 as he left Independence Hall on the final day of deliberation a bystander asked Benjamin Franklin, \"Well, Doctor, what have we got -- a Republic or a Monarchy?\" Franklin&#39;s famous reply was, \"A Republic, if you can keep it.\" When the final vote on Obama&#39;s health care reform bill was tallied on March 21st, we lost it. The only hope for our Republic lies in the third branch of government, the Judiciary, which is supposed to keep the other two branches in check. Numerous States&#39; Attorneys General are preparing to file suit as soon as Barack signs the bill. The main problem with this bill is that it doesn&#39;t do everything Obama is claiming it does. There will be a lot of uninttended consequences, there are always are when a single piece of legislation is longer than a Harry Potter novel. The unintended consequences are not what I&#39;m afraid of the most. I&#39;m afraid of the hidden language that Obama and his cronies wrote into the bill that nobody knows about yet. I&#39;m even more afraid Obama will find new energy to pass \"Cap and Tax\" and amnesty for illegal aliens bills before he loses control of Congress in November.   Posted via email   from Jason's posterous  ","author":"jasontromm","title":"We Have Lost Our Republic!","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-22 22:33:47","author_id":762,"post_id":1004,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/22\/we-have-lost-our-republic"}
{"comment_count":0,"content":"","author":"jasontromm","title":"Chocolate Covered Peeps Gelati!","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-27 20:27:22","author_id":762,"post_id":1005,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/27\/chocolate-covered-peeps-gelati"}
{"comment_count":0,"content":"I was just turned on to a new book titled \"Why Boys Fail: Saving Our Sons from an Educational System That's Leaving Them Behind\" by this article in the NY Times. I'm downloading the Kindle version to my iPod so I have it with me wherever I go. Based on what I've read so far, it should be required reading for every school teacher and school administrator. My son struggled in a public Kindergarten classroom because of his teacher's bias against boys. On several occasions he came home from school with a \"red card\" because he acted out in a way his teacher considered inappropriate. When he told me what he did, I laughed because my view was that he was just being a boy.  Boys aren't given any outlet for their pent up energy and that causes them to fidget and appear inattentive in class. Whatever happened to playing \"cowboys and indians\" or \"cops and robbers\" on the playground? Why can't they play touch football games at recess anymore? Boys will occasionally knock each other down or tackle each other on the playground. That's not a reason for harsh discipline. Get up and dust yourself off, shake hands and walk away. No blood, no foul.        Posted via web   from Jason's posterous  ","author":"jasontromm","title":"Why Boys Fail","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-30 17:10:51","author_id":762,"post_id":1006,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/30\/why-boys-fail"}
{"comment_count":0,"content":" Supporters of Obamacare don&#39;t want to debate the issue, they prefer to call those of us who don&#39;t support it racists. Next time somebody calls you a racist jerk because you want Obama to fail, ask them these five questions:  How could adding 32 million people to the health rolls save us money? How is hiring thousands of new IRS agents to enforce this not an expansion of government? How can you be considered a \"child\" until you are 26 years old? How is forcing everyone to buy something constitutional? How could there be no tort reform in this? I&#39;ll bet they don&#39;t have any answers for you. Hat tip to Greg Gutfeld at FoxNews. Related articles by Zemanta  If you oppose Obamacare, you&#39;re a racist (pajamasmedia.com)    Posted via email   from Jason's posterous  ","author":"jasontromm","title":"Five Questions for Obamacare Supporters","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-03-30 20:37:52","author_id":762,"post_id":1007,"lang":"en","url":"jasontromm.wordpress.com\/2010\/03\/30\/five-questions-for-obamacare-supporters"}
{"comment_count":0,"content":"An atheist became incensed over Christmas holiday preparations. He filed a lawsuit about the constant celebrations given to Christians and Jews while atheists had no holiday to celebrate.  The case was brought before a judge. After listening to the long, passionate presentation by the atheist's lawyer, the judge banged his gavel and declared, \"Case dismissed!\"The lawyer immediately stood and objected to the ruling. \"Your honor, how can you possibly dismiss this case? The Christians have Christmas, Easter, and many other observances. Jews have Passover, Yom Kippur, and Hanukkah. Yet, my client and all other atheists have no such holiday!\"  The judge leaned forward in his chair and simply said, \"Obviously, your client is too confused to know about, much less celebrate, his own atheist holiday!\"  The lawyer pompously said, \"Your honor, we are unaware of any such holiday for atheists. Just when might that holiday be?\"  The judge replied, \"Well, it comes every year on exactly the same date. Psalm 14:1 states, 'The fool says in his heart, there is no God.' Thus, if your client says there is no God then, according to the Bible, he is a fool. April Fool's Day is his holiday. Now, get out of my courtroom!\"  Posted via web   from Jason's posterous  ","author":"jasontromm","title":"An Atheist's Holiday","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-04-01 14:00:48","author_id":762,"post_id":1008,"lang":"en","url":"jasontromm.wordpress.com\/2010\/04\/01\/an-atheists-holiday"}
{"comment_count":0,"content":"All politicians are whores","author":"jasontromm","title":"Open for Business","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-04-07 20:02:30","author_id":762,"post_id":1009,"lang":"en","url":"jasontromm.wordpress.com\/2010\/04\/07\/open-for-business"}
{"comment_count":0,"content":"According to PolitiFact.com, Obama has broken his no tax increase promise. Remember on the campaign trail when Obama said:    I can make a firm pledge. Under my plan, no family making less than $250,000 a year will see any form of tax increase. Not your income tax, not your payroll tax, not your capital gains taxes, not any of your taxes.    I knew he was going to break that pledge as soon as the words came out of his mouth. With all the things he was promising to do for the American sheople, there's no way he could keep that promise.Remember, he said \"not any of your taxes.\" When he signed Obamacare into law on March 23, 2010 he broke that promise. Some of the taxes begin now. Some of the taxes won't take effect until 2014, when people will have to pay a fine, levied through their income taxes, if they don't have health insurance.  Related articles by Zemanta     Dingell: It will take a while for ObamaCare to \"control the people\" (hotair.com)   Media Fail to Expose Health Care Bill as Job Killer, Violation of Obama's Tax Pledge (newsbusters.org)      Posted via web   from Jason's posterous  ","author":"jasontromm","title":"Obama Breaks Promise No. 515","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-04-08 20:04:36","author_id":762,"post_id":1010,"lang":"en","url":"jasontromm.wordpress.com\/2010\/04\/08\/obama-breaks-promise-no-515"}
{"comment_count":1,"content":"I am tired of writing about politics. I've been let down by both the Republican and Democrat parties. I see no Hope and Change on either side. Until the American political system is changed to allow more parties to participate in the political process, nothing will change.  I still haven't registered to vote in South Carolina (mainly because I my PA driver's license won't expire until October) and I may not register at all. I'm going to become a political dropout. Unless people ask me about my political views, I'm not going to share them anymore.  Until I decide on something else to write about, the New Trommetter Times blog is on hiatus!  Disclaimer: I'm an admitted political junkie, so I'm probably going to suffer some withdrawal. If I can't handle it, I might just have to start writing about politics again. Wish me luck!  Photo Credit: Joseph Mark Jarvis on Flickr          Posted via web   from Jason's posterous  ","author":"jasontromm","title":"I Quit!","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-04-12 19:45:44","author_id":762,"post_id":1011,"lang":"en","url":"jasontromm.wordpress.com\/2010\/04\/12\/i-quit"}
{"comment_count":0,"content":"\r\nThose seven words make me so #!%@ing mad! Whether it's at work, at church or at a PTA meeting, I hate hearing that phrase. Those words are usually followed by \"We can't do that because that's against corporate policy,\" or some such phrase.\r\nMy usual reply is \"Just because something hasn't been done before doesn't doesn't mean we shouldn't try it now.\" Whenever somebody says, \"That's against policy\" I ask them to show me the written policy in black-and-white. Usually they can't produce any documentation and that's the most frustrating thing of all!  If you don't innovate, you'll stagnate.\r\nIf you don't try something new, you might just wind up repeating the same mistakes over and over again.\r\n\"The definition of insanity is doing the same thing over and over again and expecting different results\" ~Einstein\r\n      \r\n  Posted via web   from Jason's posterous  \r\n\r\n","author":"jasontromm","title":"We never did it that way Before","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-04-21 00:45:58","author_id":762,"post_id":1012,"lang":"en","url":"jasontromm.wordpress.com\/2010\/04\/20\/untitled-4"}
{"comment_count":0,"content":"@Frankie's Fun Park","author":"jasontromm","title":"Bumper Boats","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-05-02 20:20:43","author_id":762,"post_id":1017,"lang":"en","url":"jasontromm.wordpress.com\/2010\/05\/02\/bumper-boats"}
{"comment_count":0,"content":"\r\n\r\nThe latest craze around my house is \"Plants vs. Zombies.\" I play it on my iPod and my kids play it on our desktop computer.\r\n\r\n\r\nZombies are attacking your house and all you've got to defend yourself is some sunflowers and a pea-shooter. But if you plant them in the right place, you can keep the zombies from getting through your door. As you progress through the game the zombies get tougher, but you get more fire power. You weapons include frozen pea shooters, wallnuts and zombie eating plants. The zombies wear traffic cones, buckets and some even dance across your lawn. When night comes, it gets even scarier...\r\n\r\nRating: 5 out of 5 stars.\r\n\r\n\r\n\r\n\r\n \r\nPosted via web from Jason's posterous\r\n\r\n","author":"jasontromm","title":"Zombies Ate My Brains!","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-05-16 18:51:11","author_id":762,"post_id":1018,"lang":"en","url":"jasontromm.wordpress.com\/2010\/05\/16\/zombies-ate-my-brains"}
{"comment_count":0,"content":"Location:\r\n1848 Woodruff Rd\r\nGreenville, SC 29607\r\n(864) 458-8097\r\n\r\nI believe this establishment is aiming to be fast-food seafood. They serve mostly what I consider to be Calabash style fried seafood and chicken.\r\n\r\nIt's mainly a drive-through\/take-out kinda place. Not much room to eat inside. They have a small patio outside. Counter service only.\r\n\r\nI was really in the mood for seafood today, so I got a fried flounder sandwich. It was very good for the price. (My entire meal including fries and a drink was under $7.) I could tell the fish was frozen, not fresh because it tasted a little \"fishy.\"\r\n\r\nI'll probably go back again to try their \"Seadog\" which is haddock dipped in beer-batter, fried and served up like a hot dog. I definitely recommend the place for quickly satisfying a seafood craving.\r\n\r\nRating: 3.5 out of 5 stars","author":"jasontromm","title":"Sea Chicken (Restaurant Review)","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-05-13 18:16:49","author_id":762,"post_id":1020,"lang":"en","url":"jasontromm.wordpress.com\/2010\/05\/13\/sea-chicken"}
{"comment_count":0,"content":"First Impressions:    What an awesome new game! This week, we traded in some of our old Wii games to get Super Mario Galaxy 2. It starts out with the same story line as most Mario Brothers games, Bowser has captured the Princess and taken her far, far away. This time Mario has to travel through the galaxy in a spaceship built by Lumas to find and defeat Bowser and his evil minions.  We're just getting started, but I love the game already. My six-year old has had more hours to play than I have, so he wants to tell me how to play since he's the expert now. ;-) Mario has found his old friend Yoshi. So far, he has been transformed into a cloud and a rolling boulder.  The game play on the Wii is very intuitive. It doesn't take too long to get used to all of Mario's moves. Co-play mode has been improved a lot! The 2nd player doesn't just collect star bits anymore, they play the part of a Luma that can freeze Mario's enemies in place for a short while.  Don't let yourself get frustrated just because you can't beat a particular boss. It appears there are many paths to the center of the Galaxy.  Rating: 5 stars  Related articles by Zemanta     Be a Luma in Super Mario Galaxy 2 multiplayer (joystiq.com)   Sneak Peek: Super Mario Galaxy 2 (crunchgear.com)            Posted via web   from Jason's posterous  ","author":"jasontromm","title":"Super Mario Galaxy 2","like_count":0,"author_login":"jasontromm","blog_id":753,"date_gmt":"2010-05-29 03:52:29","author_id":762,"post_id":1022,"lang":"en","url":"jasontromm.wordpress.com\/2010\/05\/28\/super-mario-galaxy-2"}
{"comment_count":24,"commenter_ids":[50873018,13233598,6645,33499772,32439183,23768638,62394130,49333310,63053543,18780091,13727761],"post_id":4557,"lang":"en","url":"laith.wordpress.com\/2014\/04\/07\/who-dunnit-gargleblaster-156","liker_ids":[532048,13947847,16111162,16783568,18780091,33499772,42674913,47062769,49333310,62394130],"content":"The group sat tensely around the table, each looking curiously at the others.\n\nA crime had been committed.\nThe perpetrator must be found.\nThe evidence was weighed.\n\n\nFinally Tom spoke firmly, \"It was Mrs White, in the Conservatory, with the lead pipe.\"\n\n","author":"Laith","title":"Who dunnit? : Gargleblaster #156","author_login":"laith","like_count":10,"blog_id":6638,"date_gmt":"2014-04-07 16:50:20","author_id":6645}